/*尾数循环

斐波那契数列的个位数：一个60步的循环
11235,83145,94370,77415,61785.38190,
99875,27965,16730,33695,49325,72910…
进一步，斐波那契数列的最后两位数是一个300步的循环，最后三位数是一个1500步的循环，最后四位数是一个15000步的循环，最后五位数是一个150000步的循环。*/

#include "stdio.h"

int Fb[100000];
int Fn;

int main()
{
	int n;
	int cnt;
	while (scanf("%d", &n) != EOF)
	{
		if (n == -1)
		{
			break;
		}
		else
		{
			Fb[0] = 0;
			Fb[1] = 1;
			if (n >= 2)
			{
				for (cnt = 2; cnt <= 100000; cnt++)
				{
					Fb[cnt] = (Fb[cnt - 1] + Fb[cnt - 2]) % 10000;
				}
			}
			Fn = Fb[n % 15000];
			printf("%d\n", Fn);
		}
	}
}